// Найти большее из двух чисел

int num1 = 3;
int num2 = 6;

if (num1 > num2)
{
    Console.WriteLine ($"Первое число `{num1}` больше чем второе число `{num2}`");
}
if (num1 < num2)
{
    Console.WriteLine($"Первое число `{num1}` меньше чем второе число `{num2}`");
}
if (num1 == num2)
{
    Console.WriteLine($"Введенные числа равны `{num1}`");
}


