// Создать программу результат деления двух чисел
double numA = 12;
double numB = 5;
double result = numA / numB;
Console.WriteLine (result);

